#include "pentomino.h"

/*--------------------------------------------------------------------------------------------------------------------*/

typedef struct {
    int x;
    int y;
} Point;

typedef struct {
    int lenX, lenY;
    int form[5][5];
} Form;

typedef struct {
    Form figures[8];
    int count;
} Shape;

/*--------------------------------------------------------------------------------------------------------------------*/

static Shape const shapes[12] = {
    // Пентомино 1: без вращений, без отражений
    //  #
    // ###
    //  #
    {{
         {3, 3, {{0, 1, 0, 0, 0}, {1, 1, 1, 0, 0}, {0, 1, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
     }, 1},

    // Пентомино 2: два вращения, без отражений
    // #####
    {{
         {5, 1, {{2, 2, 2, 2, 2}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {1, 5, {{2, 0, 0, 0, 0}, {2, 0, 0, 0, 0}, {2, 0, 0, 0, 0}, {2, 0, 0, 0, 0}, {2, 0, 0, 0, 0}}}
     }, 2},

    // Пентомино 3: два вращения, с отражениями
    // #
    // ###
    //   #
    {{
         {3, 3, {{3, 0, 0, 0, 0}, {3, 3, 3, 0, 0}, {0, 0, 3, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 3, 3, 0, 0}, {0, 3, 0, 0, 0}, {3, 3, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{3, 3, 0, 0, 0}, {0, 3, 0, 0, 0}, {0, 3, 3, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 0, 3, 0, 0}, {3, 3, 3, 0, 0}, {3, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}}
     }, 4},

    // Пентомино 4: четыре вращения, без отражений
    // ###
    // #
    // #
    {{
         {3, 3, {{4, 4, 4, 0, 0}, {4, 0, 0, 0, 0}, {4, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{4, 4, 4, 0, 0}, {0, 0, 4, 0, 0}, {0, 0, 4, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 0, 4, 0, 0}, {0, 0, 4, 0, 0}, {4, 4, 4, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{4, 0, 0, 0, 0}, {4, 0, 0, 0, 0}, {4, 4, 4, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}}
     }, 4},

    // Пентомино 5: четыре вращения, без отражений
    //  ##
    // ##
    // #
    {{
         {3, 3, {{0, 5, 5, 0, 0}, {5, 5, 0, 0, 0}, {5, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{5, 5, 0, 0, 0}, {0, 5, 5, 0, 0}, {0, 0, 5, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 0, 5, 0, 0}, {0, 5, 5, 0, 0}, {5, 5, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{5, 0, 0, 0, 0}, {5, 5, 0, 0, 0}, {0, 5, 5, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}}
     }, 4},

    // Пентомино 6: четыре вращения, без отражений
    // ###
    //  #
    //  #
    {{
         {3, 3, {{6, 6, 6, 0, 0}, {0, 6, 0, 0, 0}, {0, 6, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 0, 6, 0, 0}, {6, 6, 6, 0, 0}, {0, 0, 6, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 6, 0, 0, 0}, {0, 6, 0, 0, 0}, {6, 6, 6, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{6, 0, 0, 0, 0}, {6, 6, 6, 0, 0}, {6, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}}
     }, 4},

    // Пентомино 7: четыре вращения, без отражений
    // ###
    // # #
    {{
         {3, 2, {{7, 7, 7, 0, 0}, {7, 0, 7, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 3, {{7, 7, 0, 0, 0}, {0, 7, 0, 0, 0}, {7, 7, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 2, {{7, 0, 7, 0, 0}, {7, 7, 7, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 3, {{7, 7, 0, 0, 0}, {7, 0, 0, 0, 0}, {7, 7, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}}
     }, 4},

    // Пентомино 8: четыре вращения, с отражениями
    // #
    // ###
    //  #
    {{
         {3, 3, {{8, 0, 0, 0, 0}, {8, 8, 8, 0, 0}, {0, 8, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 8, 8, 0, 0}, {8, 8, 0, 0, 0}, {0, 8, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 8, 0, 0, 0}, {8, 8, 8, 0, 0}, {0, 0, 8, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 8, 0, 0, 0}, {0, 8, 8, 0, 0}, {8, 8, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{8, 8, 0, 0, 0}, {0, 8, 8, 0, 0}, {0, 8, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 8, 0, 0, 0}, {8, 8, 8, 0, 0}, {8, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 8, 0, 0, 0}, {8, 8, 0, 0, 0}, {0, 8, 8, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 3, {{0, 0, 8, 0, 0}, {8, 8, 8, 0, 0}, {0, 8, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}}
     }, 8},

    // Пентомино 9: четыре вращения, с отражениями
    // ####
    //    #
    {{
         {4, 2, {{9, 9, 9, 9, 0}, {0, 0, 0, 9, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{0, 9, 0, 0, 0}, {0, 9, 0, 0, 0}, {0, 9, 0, 0, 0}, {9, 9, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {4, 2, {{9, 0, 0, 0, 0}, {9, 9, 9, 9, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{9, 9, 0, 0, 0}, {9, 0, 0, 0, 0}, {9, 0, 0, 0, 0}, {9, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{9, 0, 0, 0, 0}, {9, 0, 0, 0, 0}, {9, 0, 0, 0, 0}, {9, 9, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {4, 2, {{0, 0, 0, 9, 0}, {9, 9, 9, 9, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{9, 9, 0, 0, 0}, {0, 9, 0, 0, 0}, {0, 9, 0, 0, 0}, {0, 9, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {4, 2, {{9, 9, 9, 9, 0}, {9, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}}
     }, 8},

    // Пентомино 10: четыре вращения, с отражениями
    // ####
    //   #
    {{
         {4, 2, {{10, 10, 10, 10, 0}, {0,  0,  10, 0,  0}, {0,  0,  0, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{0,  10, 0,  0,  0}, {0,  10, 0,  0,  0}, {10, 10, 0, 0, 0}, {0,  10, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {4, 2, {{0,  10, 0,  0,  0}, {10, 10, 10, 10, 0}, {0,  0,  0, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{10, 0,  0,  0,  0}, {10, 10, 0,  0,  0}, {10, 0,  0, 0, 0}, {10, 0,  0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{10, 0,  0,  0,  0}, {10, 0,  0,  0,  0}, {10, 10, 0, 0, 0}, {10, 0,  0, 0, 0}, {0, 0, 0, 0, 0}}},
         {4, 2, {{0,  0,  10, 0,  0}, {10, 10, 10, 10, 0}, {0,  0,  0, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{0,  10, 0,  0,  0}, {10, 10, 0,  0,  0}, {0,  10, 0, 0, 0}, {0,  10, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {4, 2, {{10, 10, 10, 10, 0}, {0,  10, 0,  0,  0}, {0,  0,  0, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}}}
     }, 8},

    // Пентомино 11: четыре вращения, с отражениями
    // ###
    //   ##
    {{
         {4, 2, {{11, 11, 11, 0,  0}, {0,  0,  11, 11, 0}, {0,  0,  0, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{0,  11, 0,  0,  0}, {0,  11, 0,  0,  0}, {11, 11, 0, 0, 0}, {11, 0,  0, 0, 0}, {0, 0, 0, 0, 0}}},
         {4, 2, {{11, 11, 0,  0,  0}, {0,  11, 11, 11, 0}, {0,  0,  0, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{0,  11, 0,  0,  0}, {11, 11, 0,  0,  0}, {11, 0,  0, 0, 0}, {11, 0,  0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{11, 0,  0,  0,  0}, {11, 0,  0,  0,  0}, {11, 11, 0, 0, 0}, {0,  11, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {4, 2, {{0,  0,  11, 11, 0}, {11, 11, 11, 0,  0}, {0,  0,  0, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 4, {{11, 0,  0,  0,  0}, {11, 11, 0,  0,  0}, {0,  11, 0, 0, 0}, {0,  11, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {4, 2, {{0,  11, 11, 11, 0}, {11, 11, 0,  0,  0}, {0,  0,  0, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}}}
     }, 8},

    // Пентомино 12: четыре вращения, с отражениями
    // ###
    //  ##
    {{
         {3, 2, {{12, 12, 12, 0, 0}, {0,  12, 12, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 3, {{0,  12, 0,  0, 0}, {12, 12, 0,  0, 0}, {12, 12, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 2, {{12, 12, 0,  0, 0}, {12, 12, 12, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 3, {{12, 12, 0,  0, 0}, {12, 12, 0,  0, 0}, {12, 0,  0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 3, {{12, 0,  0,  0, 0}, {12, 12, 0,  0, 0}, {12, 12, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 2, {{0,  12, 12, 0, 0}, {12, 12, 12, 0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {2, 3, {{12, 12, 0,  0, 0}, {12, 12, 0,  0, 0}, {0,  12, 0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}},
         {3, 2, {{12, 12, 12, 0, 0}, {12, 12, 0,  0, 0}, {0,  0,  0, 0, 0}, {0, 0, 0, 0, 0}, {0, 0, 0, 0, 0}}}
     }, 8}

};

static int M = 0, N = 0, solutions_count = 0, max_count = 1 << 31;
static int const last_figure_type = 11;
static int field[62][62];
char * const delimiter = "------------------------------------------------------------\n";

/*--------------------------------------------------------------------------------------------------------------------*/

void parse_args(int argc, char ** argv) {
    printf("pentomino -c \"максимальное число решений\" -if \"имя файла ввода\" -of \"имя файла вывода\"\n");
    char const * input_file = "";
    char const * output_file = "";

    if (argc == 7) {
        max_count = atoi(argv[2]);
        input_file = argv[4];
        output_file = argv[6];
    } else if (argc == 5) {
        if (argv[1][1] == 'c') {
            max_count = atoi(argv[2]);
            if (argv[3][1] == 'i') {
                input_file = argv[4];
            } else {
                output_file = argv[4];
            }
        } else {
            input_file = argv[2];
            output_file = argv[4];
        }
    } else if (argc == 3) {
        if (argv[1][1] == 'c') {
            max_count = atoi(argv[2]);
        } else if (argv[1][1] == 'i') {
            input_file = argv[2];
        } else {
            output_file = argv[2];
        }
    }
    if (strlen(input_file)) {
        freopen(input_file, "r", stdin);
    }
    if (strlen(output_file)) {
        freopen(output_file, "w", stdout);
    }
}

void print_field(char const * format) {
    if (strcmp(format, "%sФигура: \n%s") == 0) {
        printf(format, delimiter, delimiter);
    } else {
        printf(format, delimiter, ++solutions_count, delimiter);
    }

    for (int y = 0; y < M; ++y) {
        for (int x = 0; x < N; ++x) {
            if (field[y][x] >= 0) {
                printf("%c", (char)(field[y][x] - 1 + (int)'a'));
            } else {
                printf(" ");
            }
        }
        printf("\n");
    }
}

int read_field() {
    for (int y = 0; y < 62; ++y) {
        for (int x = 0; x < 62; ++x) {
            field[y][x] = -1;
        }
    }

    char s[100];
    int not_empty_cells = 0;
    fgets(s, 100, stdin);
    M = atoi(s);
    for (int l = 0; l < M && !feof(stdin); ++l) {
        fgets(s, 100, stdin);
        for (int k = 0; s[k] != 0 && s[k] != '\n'; ++k) {
            if (l > 60 || k > 60) {
                printf("Ваш ввод не корректный, максимальный размер поля 60*60\n");
                exit(1);
            } else if (s[k] == ' ') {
                field[l][k] = -1;
            } else {
                field[l][k] = 0;
                ++not_empty_cells;
                N = (k > N) ? k : N;
            }
        }
    }
    ++N;
    if (feof(stdin)) {
        print_field("%sФигура: \n%s");
    }
    return not_empty_cells;
}

Point search_cell(int const * field, int sub_array_size, Point start, Point end, int figure_type) {
    for (; start.y < end.y; ++start.y) {
        for (; start.x < end.x; ++start.x) {
            if (field[start.y * sub_array_size + start.x] == figure_type) {
                return start;
            }
        }
        start.x = 0;
    }
    return start;
}

int count_cell(int y, int x, int count) {
    if (y < 0 || x < 0 || field[y][x] != 0) {
        return count - 1;
    }
    if (count == 4) {
        return 5;
    }
    field[y][x] = 20;
    count = count_cell(y, x + 1, count + 1);
    if (count < 5) {
        count = count_cell(y + 1, x, count + 1);
        if (count < 5) {
            count = count_cell(y, x - 1, count + 1);
            if (count < 5) {
                count = count_cell(y - 1, x, count + 1);
            }
        }
    }
    field[y][x] = 0;

    return count;
}

void find_solutions_r(int figure_type) {
    Point now = {0, 0};
    while (true) {
        now = search_cell(field, 62, now, (Point){N, M}, 0);

        if (now.y == M) {
            break;
        }
        for (int j = 0; shapes[figure_type].count != j; ++j) {
            Point f = search_cell(shapes[figure_type].figures[j].form, 5, (Point){0, 0}, (Point){5, 5},
                                  figure_type + 1);

            if (now.x - f.x >= 0 &&
                now.x - f.x + shapes[figure_type].figures[j].lenX <= N &&
                now.y + shapes[figure_type].figures[j].lenY <= M) {
                bool is_insert = true;

                for (int y = 0; y < shapes[figure_type].figures[j].lenY && is_insert; ++y) {
                    for (int x = 0; x < shapes[figure_type].figures[j].lenX && is_insert; ++x) {
                        if (shapes[figure_type].figures[j].form[y][x] == figure_type + 1 &&
                            field[now.y + y][now.x - f.x + x] != 0) {
                            is_insert = false;
                        }
                    }
                }

                if (is_insert) {
                    for (int y = 0; y < shapes[figure_type].figures[j].lenY; ++y) {
                        for (int x = 0; x < shapes[figure_type].figures[j].lenX; ++x) {
                            field[now.y + y][now.x - f.x + x] += shapes[figure_type].figures[j].form[y][x];
                        }
                    }

                    int y1 = (now.y > 1) ? now.y - 1 : 0;
                    int x1 = (now.x > f.x + 1) ? now.x - f.x - 1 : 0;

                    for (int y = y1; y < y1 + shapes[figure_type].figures[j].lenY + 2 && is_insert; ++y) {
                        for (int x = x1; x < x1 + shapes[figure_type].figures[j].lenX + 2 && is_insert; ++x) {
                            if (field[y][x] == 0 && count_cell(y, x, 0) < 5) {
                                is_insert = false;
                            }
                        }
                    }

                    if (is_insert && figure_type < last_figure_type) {
                        find_solutions_r(figure_type + 1);
                    } else if (is_insert) {
                        if (max_count == solutions_count) {
                            return;
                        }

                        Point pr = now;
                        now = search_cell(field, 62, (Point){0, 0}, (Point){N, M}, 0);

                        if (now.x == 0 && now.y == M) {
                            print_field("%sРешение №%d:\n%s");
                        }

                        now = pr;
                    }
                    for (int y = 0; y < shapes[figure_type].figures[j].lenY; ++y) {
                        for (int x = 0; x < shapes[figure_type].figures[j].lenX; ++x) {
                            field[now.y + y][now.x - f.x + x] -= shapes[figure_type].figures[j].form[y][x];
                        }
                    }
                }
            }
        }

        if (++now.x == N) {
            now.x = 0;
            if (++now.y >= M) {
                break;
            }
        }
    }
}
